adyba-123/ESP32-S2-SERVO-STEPPER-CONTROLLER/src/main.cpp
#include <Adafruit_NeoPixel.h>
#include <ESP32Servo.h> // Include the ESP32Servo library
#include <queue>        // Include the queue library for command buffering
#include <WiFi.h>       // Include WiFi library for access point
#include <ESPAsyncWebServer.h> // Include ESPAsyncWebServer library
#include <SPIFFS.h>     // Include SPIFFS for file storage

#define PIN_NEOPIXEL 39  // Define the pin where the NeoPixel is connected
#define NUM_PIXELS 1     // Number of NeoPixels
#define SERVO_PIN 35     // Change the servo pin to pin 35
#define CPX 18           // Define CPX as pin 18
#define CWX 17           // Define CWX as pin 17
#define CPY 9            // Define CPY as pin 16
#define CWY 8            // Define CWY as pin 15
#define VERSION "0.9"    // Define the current version of the program

Adafruit_NeoPixel strip(NUM_PIXELS, PIN_NEOPIXEL, NEO_GRB + NEO_KHZ800);
Servo servo; // Create a Servo object
std::queue<String> commandQueue; // Queue to store commands

// Define feedrate for X and Z axes (steps per second)
int X_FEEDRATE = 1000; // Feedrate for X-axis
int Z_FEEDRATE = 1000; // Feedrate for Z-axis

// Global variables to hold X and Z values from the web page
int globalXValue = -2000;

// Global variable to hold the command buffer
String globalCommandBuffer = "";

int globalDelayMs = 50; // Global delay in milliseconds between commands for stability
int servoStabilizationDelayMs = 500; // Configurable delay for servo stabilization

#define OFF 0x000000
#define RED 0xFF0000
#define GREEN 0x00FF00
#define YELLOW 0xFFFF00
#define BLUE 0x0000FF
#define MAGENTA 0xFF00FF

#define WIFI_PASSWORD ""             // Open network (no password)

AsyncWebServer server(80); // Create an AsyncWebServer object on port 80

void led_on(uint32_t color) {
  strip.fill(color);
  strip.show();
}

void led_off() {
  strip.fill(OFF);
  strip.show();
}

void setProcessingState() {
  led_on(RED); // Set LED to RED to indicate processing state
}

void setReadyState() {
  led_on(GREEN); // Set LED to GREEN to indicate ready state
}

void moveStepper(int steps, int pulsePin, int directionPin, int feedrate) {
  digitalWrite(directionPin, steps > 0 ? HIGH : LOW); // Set direction
  steps = abs(steps); // Use absolute value for step count

  unsigned long delayTime = 1000000UL / (2 * feedrate); // Calculate delay time
  for (int i = 0; i < steps; i++) {
    digitalWrite(pulsePin, HIGH); // Generate pulse
    delayMicroseconds(delayTime); // Half-period delay for feedrate
    digitalWrite(pulsePin, LOW); // End pulse
    delayMicroseconds(delayTime); // Half-period delay for feedrate
  }
}

// Define soft limits for the servo
const int LowAngle = 170; // Minimum allowed angle
const int HighAngle = 345; // Maximum allowed angle

void moveServo(int angle) {
  if (angle >= LowAngle && angle <= HighAngle) { // Enforce soft limits
    int mappedAngle = map(angle, 0, 360, 0, 180); // Map 0-360 to 0-180 for ESP32Servo
    servo.write(mappedAngle); // Move servo to the specified angle
    delay(servoStabilizationDelayMs); // Use configurable delay
    Serial.printf("Servo moved to angle: %d\n", angle);
  } else {
    Serial.printf("Invalid servo angle: %d. Allowed range is %d to %d.\n", angle, LowAngle, HighAngle);
  }
}

void moveStepperWithDelay(int steps, int pulsePin, int directionPin, int feedrate, int delayMs) {
  delay(delayMs); // Delay before starting stepper movement
  moveStepper(steps, pulsePin, directionPin, feedrate); // Move stepper motor
  Serial.printf("Stepper moved %d steps with delay of %d ms\n", steps, delayMs);
}

void processCommand(String command) {
  char axis = command.charAt(0); // Extract the first character (e.g., 'S', 'Z', 'X', 'D', 'F')
  int value = command.substring(1).toInt(); // Extract the numeric value after the axis

  static int stepCounter = 0; // Counter to track the step in the program

  setProcessingState(); // Indicate processing state

  switch (axis) {
    case '\x03': // CTRL+C (ASCII code 3)
      Serial.printf("[Step %d] CTRL+C received. Stopping all operations.\n", ++stepCounter);
      commandQueue = std::queue<String>(); // Clear the command queue
      setReadyState(); // Indicate ready state
      break;

    case 'S': // Servo control
      Serial.printf("[Step %d] Servo command received with angle: %d\n", ++stepCounter, value);
      moveServo(value); // Move the servo
      break;

    case 'Z': // Z-axis stepper motor control
      Serial.printf("[Step %d] Z-axis command received with value: %d\n", ++stepCounter, value);
      moveStepperWithDelay(value, CPY, CWY, Z_FEEDRATE, globalDelayMs); // Move Z-axis stepper motor with delay
      break;

    case 'X': // X-axis stepper motor control
      Serial.printf("[Step %d] X-axis command received with value: %d\n", ++stepCounter, value);
      moveStepperWithDelay(value, CPX, CWX, X_FEEDRATE, globalDelayMs); // Move X-axis stepper motor with delay
      break;

    case 'D': // Delay in milliseconds
      Serial.printf("[Step %d] Delay command received with value: %d ms\n", ++stepCounter, value);
      if (value > 0) {
        unsigned long startTime = millis();
        while (millis() - startTime < value) {
          // Non-blocking delay: Allow other tasks to run during the delay
          if (Serial.available() > 0) {
            char incomingChar = Serial.read(); // Read incoming characters
            Serial.print("Ignoring input during delay: ");
            Serial.println(incomingChar);
          }
        }
      } else {
        Serial.println("Invalid delay value. Please enter a positive number.");
      }
      break;

    case 'F': // Change feedrate for X-axis
      if (value > 0) {
        X_FEEDRATE = value;
        Serial.printf("Feedrate for X-axis updated to %d steps per second.\n", value);
      } else {
        Serial.println("Invalid feedrate value for X-axis. Please enter a positive number.");
      }
      break;

    case 'G': // Change feedrate for Z-axis
      if (value > 0) {
        Z_FEEDRATE = value;
        Serial.printf("Feedrate for Z-axis updated to %d steps per second.\n", value);
      } else {
        Serial.println("Invalid feedrate value. Please enter a positive number.");
      }
      break;

