adyba-123/ESP32-S2-SERVO-STEPPER-CONTROLLER/src/main.cpp
    case 'H': // Set globalXValue
      Serial.printf("[Step %d] H command received with value: %d\n", ++stepCounter, value);
      globalXValue = value;
      Serial.printf("globalXValue updated to: %d\n", globalXValue);
      break;

    case 'C': // Set globalDelayMs
      Serial.printf("[Step %d] C command received with value: %d\n", ++stepCounter, value);
      if (value >= 0) {
        globalDelayMs = value;
        Serial.printf("globalDelayMs updated to: %d ms\n", globalDelayMs);
      } else {
        Serial.println("Invalid delay value. Please enter a non-negative number.");
      }
      break;

    default:
      Serial.printf("[Step %d] Invalid command received: %s\n", ++stepCounter, command.c_str());
      Serial.println("Invalid command. Use 'S', 'Z', 'X', 'D', 'F', 'G' or 'H' followed by a value.");
      break;
  }

  setReadyState(); // Indicate ready state
}

void processBuffer(String buffer) {
  globalCommandBuffer = buffer; // Update the global command buffer
  static int stepCounter = 0;   // Counter to track the step in the program
  stepCounter = 0;              // Reset step counter for each new program

  int start = 0;
  while (start < buffer.length()) {
    int end = buffer.indexOf(',', start); // Find the next comma
    if (end == -1) {                      // If no more commas, process the last command
      end = buffer.length();
    }
    String command = buffer.substring(start, end); // Extract the command
    command.trim();                                // Trim whitespace
    commandQueue.push(command);                   // Add the command to the queue
    start = end + 1;                               // Move to the next command
  }
}

void processNextCommand() {
  if (!commandQueue.empty()) {
    String command = commandQueue.front(); // Get the next command
    commandQueue.pop(); // Remove the command from the queue
    processCommand(command); // Process the command
    delay(globalDelayMs); // Add delay for stability
    Serial.printf("COMMAND SENT with delay: %d ms\n", globalDelayMs); // Print command sent message with delay
    led_on(GREEN); // Indicate ready state after program finishes
  }
}

void loop() {
  static String commandBuffer = ""; // Buffer to store incoming characters

  while (Serial.available() > 0) {
    char incomingChar = Serial.read(); // Read one character at a time

    if (incomingChar == ',') { // If a comma is received, buffer the current command
      commandBuffer.trim(); // Remove any extra whitespace
      if (!commandBuffer.isEmpty()) {
        commandQueue.push(commandBuffer); // Add the command to the queue
      }
      commandBuffer = ""; // Clear the buffer for the next command
    } else {
      commandBuffer += incomingChar; // Append the character to the buffer
    }
  }

  // If there are no more characters to read and the buffer is not empty, process the last command
  if (!commandBuffer.isEmpty() && commandBuffer.indexOf(',') == -1) {
    commandBuffer.trim(); // Remove any extra whitespace
    commandQueue.push(commandBuffer); // Add the last command to the queue
    commandBuffer = ""; // Clear the buffer after adding the command
  }

  // Execute the next command in the queue if available
  if (!commandQueue.empty()) {
    processNextCommand();
  }

  // Indicate the system is ready if no commands are in the queue
  if (commandQueue.empty()) {
    setReadyState();
  }
}

void deleteConfigFile() {
  if (SPIFFS.exists("/config.txt")) {
    if (SPIFFS.remove("/config.txt")) {
      Serial.println("Config file deleted successfully.");
    } else {
      Serial.println("Failed to delete config file.");
    }
  } else {
    Serial.println("Config file does not exist.");
  }
}

void saveValues(AsyncWebServerRequest *request) {
  File file = SPIFFS.open("/config.txt", FILE_WRITE);
  if (!file) {
    Serial.println("Failed to open config file for writing.");
    return;
  }
  file.printf("XSpeed:%d\n", X_FEEDRATE);
  file.printf("ZSpeed:%d\n", Z_FEEDRATE);
  file.printf("globalXValue:%d\n", globalXValue); // Save globalXValue
  file.printf("globalDelayMs:%d\n", globalDelayMs); // Save globalDelayMs
  // Save the global command buffer
  file.printf("CommandBuffer:%s\n", globalCommandBuffer.c_str());
  Serial.printf("CommandBuffer:%s\n", globalCommandBuffer.c_str());

  file.close();
  Serial.println("Values saved to config file.");
}

void loadValues() {
  File file = SPIFFS.open("/config.txt", FILE_READ);
  if (!file) {
    Serial.println("Config file not found. Continuing with default values.");
    return; // Continue with default values if the file does not exist
  }

  while (file.available()) {
    String line = file.readStringUntil('\n');
    if (line.startsWith("XSpeed:")) {
      X_FEEDRATE = line.substring(7).toInt();
    } else if (line.startsWith("ZSpeed:")) {
      Z_FEEDRATE = line.substring(7).toInt();
    } else if (line.startsWith("globalXValue:")) {
      globalXValue = line.substring(13).toInt(); // Load globalXValue
    } else if (line.startsWith("globalDelayMs:")) {
      globalDelayMs = line.substring(14).toInt(); // Load globalDelayMs
    } else if (line.startsWith("CommandBuffer:")) {
      globalCommandBuffer = line.substring(14); // Load the command buffer into the global variable
      globalCommandBuffer.trim(); // Remove any extra whitespace
    }
  }
  file.close();

  Serial.println("Values loaded from config file.");
  Serial.printf("Loaded globalXValue: %d\n", globalXValue);
  Serial.printf("Loaded globalDelayMs: %d ms\n", globalDelayMs);
  Serial.printf("Loaded CommandBuffer: %s\n", globalCommandBuffer.c_str());
}

void setupWiFi() {
  // Get the MAC address of the ESP32
  uint8_t mac[6];
  WiFi.macAddress(mac);

  // Format the AP name as "WIRE-BENDER-<VERSION>-<MAC>"
  char apName[40];
  snprintf(apName, sizeof(apName), "WIRE-BENDER-%s-%02X%02X%02X", VERSION, mac[3], mac[4], mac[5]);

  // Start the WiFi access point with the generated name
  WiFi.softAP(apName, WIFI_PASSWORD);

  Serial.print("Access Point started. AP Name: ");
  Serial.println(apName);
  Serial.print("IP address: ");
  Serial.println(WiFi.softAPIP());
}

void setupWebServer() {
  // Serve the HTML page
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    String html = R"rawliteral(
      <!DOCTYPE html>
      <html>
      <head>
        <title>ESP32-S2 Control )rawliteral" + String(VERSION) + R"rawliteral(</title>
        <style>
          body { font-family: Arial, sans-serif; text-align: center; margin-top: 50px; }
          input, textarea { padding: 10px; width: 600px; } /* Buffer text box 200% wider */
          textarea { resize: none; } /* Prevent resizing of the text area */
          .large-button { 
            padding: 30px 60px; /* 200% larger */
            font-size: 24px; 
            font-weight: bold; /* Bold text */
            margin: 10px; 
          }
          .small-button { 
            padding: 10px 20px; 
            font-weight: bold; /* Bold text */
            margin: 5px; 
          }
          .button-container { margin-top: 20px; }
          .example-command, h2 { font-size: 16px; } /* Match size of <label> text */
        </style>
        <script>
          // Removed unused variable `let isRunning = false;`

          function sendCommandBuffer() {
            const commandBuffer = document.getElementById('commandBuffer').value.trim();
            if (!commandBuffer) {
              document.getElementById('response').innerText = 'Error: Command buffer cannot be empty.';
              return;
            }
            updateBackgroundColor('red'); // Indicate program is running
            fetch(`/commandBuffer?buffer=${encodeURIComponent(commandBuffer)}`)
              .then(response => response.text())
              .then(data => {
                document.getElementById('response').innerText = data;
                // Removed the undefined checkStatus function call
              })
              .catch(err => {
                document.getElementById('response').innerText = 'Error sending command buffer';
                updateBackgroundColor('red'); // Indicate error
              });
          }

          function setSpeed(axis) {
            const value = document.getElementById(`${axis}Speed`).value.trim();
            if (!value || isNaN(value)) {
              document.getElementById('response').innerText = `Error: Enter a valid speed for ${axis}-axis.`;
              return;
            }
            const command = axis === 'X' ? `F${value}` : `G${value}`;
            fetch(`/command?cmd=${command}`)
              .then(response => response.text())
              .then(data => {
                document.getElementById('response').innerText = data;
              })
              .catch(err => {
                document.getElementById('response').innerText = `Error setting speed for ${axis}-axis.`;
              });
          }

