adyba-123/ESP32-S2-SERVO-STEPPER-CONTROLLER/src/main.cpp
          function saveValues() {
            fetch(`/saveValues`)
              .then(response => response.text())
              .then(data => {
                document.getElementById('response').innerText = data;
              })
              .catch(err => {
                document.getElementById('response').innerText = 'Error saving values.';
              });
          }

          function loadValues() {
            fetch(`/loadValues`)
              .then(response => response.text())
              .then(data => {
                const values = JSON.parse(data);
                document.getElementById('XSpeed').value = values.XSpeed;
                document.getElementById('ZSpeed').value = values.ZSpeed;
                document.getElementById('commandBuffer').value = values.Buffer;
                document.getElementById('response').innerText = 'Values loaded successfully.';
              })
              .catch(err => {
                document.getElementById('response').innerText = 'Error loading values.';
              });
          }

          function deleteConfig() {
            fetch(`/deleteConfig`)
              .then(response => response.text())
              .then(data => {
                document.getElementById('response').innerText = data;
              })
              .catch(err => {
                document.getElementById('response').innerText = 'Error deleting config file.';
              });
          }

          function updateBackgroundColor(color) {
            document.body.style.backgroundColor = color;
          }

          function loadWire() {
            fetch(`/loadWire`)
              .then(response => response.text())
              .then(data => {
                document.getElementById('response').innerText = data;
              })
              .catch(err => {
                document.getElementById('response').innerText = 'Error executing LOAD WIRE command.';
              });
          }

          function navigateToHelp() {
            window.location.href = '/help';
          }

          
        </script>
      </head>
      <body>
        <h1>WIRE BENDER - )rawliteral" + String(VERSION) + R"rawliteral(</h1>
        <div>
          <textarea id="commandBuffer" rows="4" cols="50" placeholder="Enter command buffer (e.g., S90,Z100,D500)"></textarea>
          <br>
          <div class="button-container">
            <button class="large-button" onclick="sendCommandBuffer()">Send Buffer</button>
            <button class="large-button" onclick="loadWire()">LOAD WIRE</button>
          </div>
          <div class="button-container">
            <button class="small-button" onclick="saveValues()">Save Values</button>
            <button class="small-button" onclick="loadValues()">Load Values</button>
            <button class="small-button" onclick="deleteConfig()">Delete Config File</button>
            <button class="small-button" onclick="window.location.href='/viewConfig'">View Config File</button>
            <button class="small-button" onclick="navigateToHelp()">HELP</button>
          </div>
        </div>
        <div style="margin-top: 20px;">
          <label for="XSpeed">X-axis Speed:</label>
          <input type="number" id="XSpeed" placeholder="Enter speed for X">
          <button class="small-button" onclick="setSpeed('X')">Set X Speed</button>
          <br><br>
          <label for="ZSpeed">Z-axis Speed:</label>
          <input type="number" id="ZSpeed" placeholder="Enter speed for Z">
          <button class="small-button" onclick="setSpeed('Z')">Set Z Speed</button>
        </div>
        <div id="response" style="margin-top: 20px; color: blue;"></div>
      </body>
      </html>
    )rawliteral";
    request->send(200, "text/html", html);
  });

  // Add a new endpoint for the help page
  server.on("/help", HTTP_GET, [](AsyncWebServerRequest *request) {
    String helpHtml = R"rawliteral(
      <!DOCTYPE html>
      <html>
      <head>
        <title>Help - Supported Commands</title>
        <style>
          body { font-family: Arial, sans-serif; text-align: center; margin-top: 50px; }
          ul { text-align: left; display: inline-block; }
          a { text-decoration: none; color: blue; font-weight: bold; }
        </style>
      </head>
      <body>
        <h1>Supported Commands</h1>
        <ul>
          <li><strong>S:</strong> Servo control (e.g., S90 for 90 degrees)</li>
          <li><strong>D:</strong> Delay in milliseconds (e.g., D500 for 500ms delay)</li>
          <li><strong>Z:</strong> Z-axis stepper motor control (e.g., Z100 for 100 steps)</li>
          <li><strong>X:</strong> X-axis stepper motor control (e.g., X100 for 100 steps)</li>
          <li><strong>F:</strong> Change feedrate (speed) for X-axis (e.g., F1500 for 1500 steps/second)</li>
          <li><strong>G:</strong> Change feedrate (speed) for Z-axis (e.g., G1200 for 1200 steps/second)</li>
          <li><strong>H:</strong> Set globalXValue (e.g., H-1300 to set globalXValue to -1300)</li>
          <li><strong>C:</strong> Set globalDelayMs (e.g., C100 to set delay to 100 ms)</li>
          <li><strong>LOAD WIRE:</strong> Moves X-axis by the predefined globalXValue.</li>
        </ul>
        <a href="/">Back to Home</a>
      </body>
      </html>
    )rawliteral";
    request->send(200, "text/html", helpHtml);
  });

  // Handle command buffer input
  server.on("/commandBuffer", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (request->hasParam("buffer")) {
      String buffer = request->getParam("buffer")->value();
      processBuffer(buffer); // Update the global command buffer and process it
      request->send(200, "text/plain", "Command buffer received: " + buffer);
    } else {
      request->send(400, "text/plain", "Missing 'buffer' parameter");
    }
  });

  // Handle command input
  server.on("/command", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (request->hasParam("cmd")) {
      String command = request->getParam("cmd")->value();
      commandQueue.push(command); // Add the command to the queue
      request->send(200, "text/plain", "Command received: " + command);
    } else {
      request->send(400, "text/plain", "Missing 'cmd' parameter");
    }
  });

