adyba-123/ESP32-S2-SERVO-STEPPER-CONTROLLER/src/main.cpp
  server.on("/saveValues", HTTP_GET, [](AsyncWebServerRequest *request) {
      saveValues(request);
    request->send(200, "text/plain", "Values saved successfully.");
  });

  server.on("/loadValues", HTTP_GET, [](AsyncWebServerRequest *request) {
    loadValues(); // Reload values from the config file
    String json = "{\"XSpeed\":" + String(X_FEEDRATE) + 
                  ",\"ZSpeed\":" + String(Z_FEEDRATE) + 
                  ",\"globalXValue\":" + String(globalXValue) + 
                  ",\"globalDelayMs\":" + String(globalDelayMs) + 
                  ",\"Buffer\":\"" + globalCommandBuffer + "\"}";
    request->send(200, "application/json", json);
  });

  server.on("/deleteConfig", HTTP_GET, [](AsyncWebServerRequest *request) {
    deleteConfigFile();
    request->send(200, "text/plain", "Config file deleted.");
  });

  // Serve the config file contents
  server.on("/viewConfig", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (SPIFFS.exists("/config.txt")) {
      File file = SPIFFS.open("/config.txt", FILE_READ);
      if (file) {
        String content = "";
        while (file.available()) {
          content += char(file.read()); // Read the entire file content
        }
        file.close();
        String html = "<!DOCTYPE html><html><head><title>Config File</title></head><body>";
        html += "<h1>Config File Contents</h1><pre>" + content + "</pre>";
        html += "<a href='/'>Back to Home</a></body></html>";
        request->send(200, "text/html", html);
      } else {
        request->send(500, "text/plain", "Failed to open config file.");
      }
    } else {
      request->send(404, "text/plain", "Config file not found.");
    }
  });

  // Add a new endpoint to handle the LOAD WIRE command
  server.on("/loadWire", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (globalXValue != 0) {
      String command = "X" + String(globalXValue);
      commandQueue.push(command); // Add the command to the queue
      request->send(200, "text/plain", "LOAD WIRE command executed: " + command);
    } else {
      request->send(400, "text/plain", "Error: globalXValue is not set.");
    }
  });

  server.begin(); // Start the server
  Serial.println("Web server started.");
}

void setup() {
  Serial.begin(115200); // Initialize serial communication
  unsigned long startTime = millis();
  while (!Serial && millis() - startTime < 5000) {
    // Wait for the serial connection to be established for up to 5 seconds
    delay(100);
  }

  Serial.println("Initializing...");
  Serial.print("Servo attached to pin: ");
  Serial.println(SERVO_PIN); // Output the pin number

  strip.begin();  // Initialize the NeoPixel library
  strip.show();   // Turn off all pixels initially

  pinMode(CPX, OUTPUT); // Set CPX as output
  pinMode(CWX, OUTPUT); // Set CWX as output
  pinMode(CPY, OUTPUT); // Set CPY as output
  pinMode(CWY, OUTPUT); // Set CWY as output

  servo.setPeriodHertz(50); // Set the PWM frequency to 50Hz
  servo.attach(SERVO_PIN, 500, 2500); // Attach the servo with min/max pulse widths
  servo.write(map(LowAngle, 0, 360, 0, 180)); // Set the servo to the minimum allowed angle (LowAngle)

  led_on(GREEN); // Turn LED to GREEN to indicate ready state
  Serial.print("READY "); // Output READY message to serial
  Serial.println(VERSION); // Append the version to the READY message

  // Initialize SPIFFS
  if (!SPIFFS.begin(true)) {
    Serial.println("An error occurred while mounting SPIFFS. Continuing without file system.");
  } else {
    loadValues(); // Attempt to load values from the config file
  }

  setupWiFi(); // Set up the WiFi access point
  setupWebServer(); // Set up the web server
}